update docks
